export async function onRequestPost(context) {
  const { env } = context;
  try {
    const db = env.DB;
    let { results: steps } = await db.prepare("SELECT * FROM ChecklistTemplate ORDER BY StepIndex ASC").all();

    if (steps.length === 0) {
      const defaultSteps = [
        "ถ้าเป็นผลไม้หรือน้ำอ้อยควร ต้ม ก่อนนำไปหมักเสมอ",
        "เตรียมถังหมัก",
        "ใส่ โซเดียมเมตาไบซัลไฟต์ ในถังหมัก",
        "ใส่ น้ำ ตามปริมาณน้ำที่กำหนด",
        "ใส่ น้ำตาล ตามปริมาณที่กำหนด",
        "คนให้ละลายจนหมด",
        "ตรวจสอบอุณหภูมิน้ำ ปกติ 22-25°C ร้อนเกินไป 25-28°C",
        "ใส่ ข้าวสุกใหม่ หรือ ธัญพืชอื่น ล้างข้าวหรือธัญพืชก่อนนึ่งทุกครั้ง",
        "ตรวจสอบอุณหภูมิน้ำ หลังใส่ข้าวสุก อุณหภูมิน้ำจะเพิ่มขึ้นชั่วคราวประมาณ 3-4°C อุณหภูมิไม่ควรเกิน 32°C",
        "ใส่ ลูกแป้ง ตามปริมาณที่กำหนด",
        "ใส่ ยีสต์ ตามปริมาณที่กำหนด",
        "ใส่ เอนไซม์ ตามปริมาณที่กำหนด",
        "คนให้เข้ากัน",
        "เช็คความหวานของน้ำก่อนหมัก",
        "วันที่ 1 ใช้ผ้าปิดคลุมฝาไว้ ไม่ควรปิดสนิท",
        "วันที่ 2 ใช้ถุงปิดฝาให้สนิท",
        "หมักจนครบ 15 - 20 วัน",
        "เช็คความหวานของน้ำหมัก",
        "หากต้องการรสชาติและกลิ่นที่ กลมกล่อมหอม ให้กรองกากออกให้เหลือแค่น้ำไว้อีก 1-5 วัน",
        "ทำการกลั่น",
        "ใช้ไฟกลาง 20-30 นาที",
        "เร่งไฟแรง อุณหภูมิอยู่ที่ 70-90°C",
        "น้ำแอลกอฮอล์ แรกให้เอาออก น้ำหมัก 100 ลิตร ให้เอาน้ำแอลกอฮอล์แรกออก 100cc",
        "พอแอลกอฮอล์ถึง 50 ดีกรีแล้วเบาไฟลงใช้ไฟกลาง",
        "พอแอลกอฮอล์ถึง 40-30 ดีกรีแล้วปิดไฟ",
        "เสร็จการกลั่น",
        "ปรับ ค่าดีกรีแอลกอฮอล์ เติมน้ำเพื่อปรับค่าแอลกอฮอล์",
        "พักให้แอลกอฮอล์เย็นตัวลง 1-3 วันหรือให้เป็นอุณหภูมิห้อง",
        "ทำการกรองแอลกอฮอล์ 1 - 2 รอบ",
        "พักแอลกอฮอล์ ไว้ 3 - 5 วันแล้วค่อยนำมาขาย 50% ของแอลกอฮอล์ที่ผลิตได้ แล้วผลิตใหม่แล้วนำมาผสมกับแอลกอฮอล์เก่าที่เก็บไว้ทำให้รสชาติกลิ่นคงที่",
        "แล้วผลิตใหม่ แล้วนำมาผสมกับแอลกอฮอล์เก่าที่เก็บไว้ทำให้รสชาติกลิ่นคงที่"
      ];
      
      const list = defaultSteps.map((text, index) => {
        return { text: text, color: "blue", StepIndex: index };
      });

      for (const item of list) {
        await db.prepare("INSERT OR IGNORE INTO ChecklistTemplate (StepIndex, Text, Color) VALUES (?, ?, ?)")
          .bind(item.StepIndex, item.text, item.color).run();
      }
      
      steps = list;
    } else {
      steps = steps.map(row => ({ text: row.Text, color: row.Color }));
    }

    return new Response(JSON.stringify(steps), {
      headers: { "Content-Type": "application/json" }
    });
  } catch (err) {
    return new Response(JSON.stringify({ error: err.toString() }), {
      status: 500,
      headers: { "Content-Type": "application/json" }
    });
  }
}
